In [4]:
import pandas as pd
#Define a dictionary 'x'

x = {'Name': ['Rose','John', 'Jane', 'Mary'], 'ID': [1, 2, 3, 4], 'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'], 
      'Salary':[100000, 80000, 50000, 60000]}

#casting the dictionary to a DataFrame
df = pd.DataFrame(x)

#display the result df
df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [5]:
x = df[['ID']]
x

   ID
0   1
1   2
2   3
3   4

In [6]:
type(x)

pandas.core.frame.DataFrame

In [9]:
x = df[['Department']]
x

        Department
0  Architect Group
1   Software Group
2      Design Team
3   Infrastructure

In [14]:
z = df[['Department', 'Salary', 'ID']]
z

        Department  Salary  ID
0  Architect Group  100000   1
1   Software Group   80000   2
2      Design Team   50000   3
3   Infrastructure   60000   4

In [22]:
y = {'Student' : ['David', 'Samuel', 'Terry', 'Evan'], 'Age' : ['27', '24', '22', '32'], 'Country' : ['UK', 'Canada', 'China', 'USA'], 'Course' : ['Python', 'Data Structure', 'Machine Learning', 'Web Development'], 'Marks' : ['85', '72', '89', '76']} 
df1 = pd.DataFrame(y)
df1

  Student Age Country            Course Marks
0   David  27      UK            Python    85
1  Samuel  24  Canada    Data Structure    72
2   Terry  22   China  Machine Learning    89
3    Evan  32     USA   Web Development    76

In [26]:
b = df1[['Marks']]
b

  Marks
0    85
1    72
2    89
3    76

In [28]:
c=df1[['Country', 'Course']]
c

  Country            Course
0      UK            Python
1  Canada    Data Structure
2   China  Machine Learning
3     USA   Web Development

In [29]:
x = df1['Student']
x

0     David
1    Samuel
2     Terry
3      Evan
Name: Student, dtype: object

In [30]:
type(x)

pandas.core.series.Series

In [31]:
df1.iloc[0,0]

'David'

In [37]:
df.loc[0, 'Salary']

100000

In [41]:
df2 = df
df2=df2.set_index("Name")
df2.head()

      ID       Department  Salary
Name
Rose   1  Architect Group  100000
John   2   Software Group   80000
Jane   3      Design Team   50000
Mary   4   Infrastructure   60000

In [42]:
df2.loc['Jane', 'Salary']

50000